report.tex
% Created 2025-06-02 Mon 22:44
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Orhan Berkay Yılmaz - 150210054}
\date{\today}
\title{Sudoku Graph Coloring Solver}
\hypersetup{
 pdfauthor={Orhan Berkay Yılmaz - 150210054},
 pdftitle={Sudoku Graph Coloring Solver},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 30.1 (Org mode 9.7.11)}, 
 pdflang={English}}
\begin{document}

\maketitle
\section{Overview}
\label{sec:orgfcd7e9e}
This project implements a Sudoku solver using graph coloring algorithms. The implementation treats Sudoku as a graph coloring problem where each cell is a vertex and edges represent constraints (same row, column, or block).

There are 2 executables 'main' and 'main\textsubscript{simpl}'. 'main\textsubscript{simpl}' only provides dependency creation, greedy coloring and 4x4 board. 'main' is way more configurable and supports the following solvers and both 4x4 and 9x9 boards.
\subsection{Graph Representation}
\label{sec:org61ba6c8}
\begin{itemize}
\item Each Sudoku cell is represented as a vertex in the graph
\item Edges connect vertices that cannot have the same value
\item Three types of constraints create edges:
\begin{enumerate}
\item Row constraints: cells in the same row
\item Column constraints: cells in the same column
\item Block constraints: cells in the same 2×2 or 3×3 block
\end{enumerate}
\item The graph is represented using an adjacency matrix for efficient constraint checking
\end{itemize}
\subsection{Solver Types}
\label{sec:org2f036af}
\begin{enumerate}
\item Greedy Solver
\begin{itemize}
\item Simple vertex coloring approach
\item O(n²) time complexity
\item May not find optimal solutions
\item Colors vertices in order, using first available color
\item Fast but may get stuck in local minima
\end{itemize}

\item DSatur Solver
\begin{itemize}
\item \url{https://en.wikipedia.org/wiki/DSatur}
\item Uses saturation degree heuristic
\item More efficient than greedy
\item Better solution quality
\item Saturation degree = number of different colors used by neighbors
\item Always picks vertex with highest saturation degree
\item If tied, picks vertex with highest degree
\end{itemize}

\item Backtracking Solver
\begin{itemize}
\item Complete search algorithm
\item Uses MRV (Minimum Remaining Values) heuristic
\item Guarantees solution if one exists
\item Tries all possible colors for each vertex
\item Backtracks when no valid color is found
\item Uses MRV to pick most constrained vertex first
\item Maintains best attempt for partial solutions
\end{itemize}

\item Heuristic Kempe Solver
\begin{itemize}
\item Based on: \url{https://www.cs.princeton.edu/\~appel/Color.pdf} p.9
\item Uses degree-based vertex selection
\item Handles complex constraint propagation
\item Prioritizes vertices with degree < K
\item Uses color constraints from neighbors
\item Maintains best attempt for partial solutions
\item Can handle complex constraint chains
\end{itemize}
\end{enumerate}
\subsection{Step Counting}
\label{sec:org0ad7e44}
\begin{itemize}
\item Each solver tracks number of coloring attempts
\item Greedy/DSatur: Count vertex coloring attempts
\begin{itemize}
\item One step per vertex coloring attempt
\item Includes failed attempts
\end{itemize}
\item Backtracking/Kempe: Count color assignment attempts
\begin{itemize}
\item One step per color assignment
\item Includes backtracking steps
\item Higher step count indicates more complex solving process
\end{itemize}
\end{itemize}
\section{Usage}
\label{sec:orgc417aab}
\begin{verbatim}
make all
./main <solver_type> [board_size]
\end{verbatim}

Where:
\begin{itemize}
\item solver\textsubscript{type}: greedy, dsatur, backtrack, kempe
\item board\textsubscript{name}: 4x4 (default) or 9x9 or 9x9\textsubscript{extreme}
\end{itemize}
\subsection{Example Output}
\label{sec:orgd5d5318}
\begin{verbatim}
Using Heuristic Kempe solver on 4x4 board:
 4  1 -1  3 
-1  2 -1  4 
 2 -1  4  1 
 1  4 -1 -1 
=========================
Solving Sudoku...
=========================
 4  1  2  3 
 3  2  1  4 
 2  3  4  1 
 1  4  3  2 
Steps taken: 6
\end{verbatim}
\end{document}
